(korean)

하노이 타워

하노이 타워란?
중앙에 막대를 끼울 수 있는 납작한 원반이 있다.

한 막대에 마치 피라미드처럼 큰 원반을 아래쪽에 둔 형태로 원반은 쌓여 있다.

이 원반을 다른 막대로 옮겨야 되는데 어떻게 옮길 수 있을까?

가장 먼저 생각해 볼 수 있는 것은 가장 큰 원반을 다른 막대의 가장 밑에 두기 위한 목표를 갖는 것이다.

일단 한 막대에 피라미드 처럼 쌓아 올려진 원반들을 생각해 보자.

또 다른 하나의 막대로 하나씩 옮기면 역피라미드 형태로 된다.

역피라미드 형태의 원반을 다른 막대에 하나씩 쌓으면 피라미드 형태로 바뀐다.

이를 방지하기 위해 작은 원반 위에 큰 원반을 쌓을 수 없다는 규칙이 있다.

전략은 동일하다.
가장 큰 원반을 다른 막대의 가장 밑에 두기 위한 목표를 갖는 것이다.

일단 하나의 막대기에 피라미드처럼 쌓인 것을 다른 막대 하나로 옮길 때 하나의 막대에 2개의 원반 이상을 넣으면 작은 원반 위에 큰 원반을 쌓게 된다.

일단 존재하는 막대가 3개라면 처음 피라미드처럼 쌓인 막대 하나의 맨 위의 원반을 다른 막대에 옮기면 해당 원반 위에는 작은 것 위에 큰 것을 쌓을 수 없다는 문제로 인해 바로 옮길 수 없게 된다.

그럼 일단 피라미드처럼 쌓인 첫번째 원반들의 맨위 두개의 원반을 옮기는 것은 다른 한 막대에 옮길 수 없다.

하나의 막대기에 옮기고 또 다른 하나의 막대기에 옮겨야 한다.

그리고 그 다음 원래의 피라미드 처럼 쌓인 막대의 원반은 그 보다 작은 것만 다른 두 막대에 있기 때문에 옮길 수 없게 된다.

따라서 처음 쌓인 원반들의 윗 부분 원반을 옮기기 위해서는 앞서 옮긴 두개의 원반을 한 쪽으로 치워줘야지 총 3개의 막대기만 존재하는 환경에서 옮길 수 있다.

앞서 옮긴 두개의 원반 중 작은 녀석을 큰 녀석에게 옮겨 준다.

작은 녀석을 옮긴 자리는 비게 되므로 3번째로 작은 원반을 옮길 수 있게 된다.

이것을 빈 막대에 옮길 수 밖에 없는데 왜냐하면, 작은 원반 위에 큰 원반을 옮길 수 없다는 제약조건 때문이다.

2개의 원반이 있는 막대의 것을 다른 막대에 옮기는 것도 역피라미드 구조가 되기 때문에 작은 원반 위에 큰 원반을 옮길 수 없다는 제약조건에 걸린다.

일단 3번째로 작은 원반은 빈 막대에 옮기는데 목적을 생각 해 보자. 가장 큰 원반을 가장 밑에 위치시키는 것을 목표로 한다.
